In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Melbourne_housing_FULL.csv")

In [3]:
df.head()

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,68 Studley St,2,h,NaN,SS,Jellis,3/09/2016,2.5,3067.0,...,1.0,1.0,126.0,NaN,NaN,Yarra City Council,-37.8014,144.9958,Northern Metropolitan,4019.0
1,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,...,1.0,1.0,202.0,NaN,NaN,Yarra City Council,-37.7996,144.9984,Northern Metropolitan,4019.0
2,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,...,1.0,0.0,156.0,79.0,1900.0,Yarra City Council,-37.8079,144.9934,Northern Metropolitan,4019.0
3,Abbotsford,18/659 Victoria St,3,u,NaN,VB,Rounds,4/02/2016,2.5,3067.0,...,2.0,1.0,0.0,NaN,NaN,Yarra City Council,-37.8114,145.0116,Northern Metropolitan,4019.0
4,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,...,2.0,0.0,134.0,150.0,1900.0,Yarra City Council,-37.8093,144.9944,Northern Metropolitan,4019.0

In [4]:
df.shape

(34857, 21)

In [5]:
df.columns.to_list()

['Suburb',
 'Address',
 'Rooms',
 'Type',
 'Price',
 'Method',
 'SellerG',
 'Date',
 'Distance',
 'Postcode',
 'Bedroom2',
 'Bathroom',
 'Car',
 'Landsize',
 'BuildingArea',
 'YearBuilt',
 'CouncilArea',
 'Lattitude',
 'Longtitude',
 'Regionname',
 'Propertycount']

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34857 entries, 0 to 34856
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Suburb         34857 non-null  object
 1   Address        34857 non-null  object
 2   Rooms          34857 non-null  int64
 3   Type           34857 non-null  object
 4   Price          27247 non-null  float64
 5   Method         34857 non-null  object
 6   SellerG        34857 non-null  object
 7   Date           34857 non-null  object
 8   Distance       34856 non-null  float64
 9   Postcode       34856 non-null  float64
 10  Bedroom2       26640 non-null  float64
 11  Bathroom       26631 non-null  float64
 12  Car            26129 non-null  float64
 13  Landsize       23047 non-null  float64
 14  BuildingArea   13742 non-null  float64
 15  YearBuilt      15551 non-null  float64
 16  CouncilArea    34854 non-null  object
 17  Lattitude      26881 non-null  float64
 18  Longtitude     26881 non-null  float64
 19  Regionname     34854 non-null  object
 20  Propertycount  34854 non-null  float64
dtypes: float64(12), int64(1), object(8)
memory usage: 5.6+ MB

In [10]:
df[['Car', 'Bathroom', 'Rooms', 'Landsize']].describe().round()

           Car  Bathroom    Rooms  Landsize
count  26129.0   26631.0  34857.0   23047.0
mean       2.0       2.0      3.0     594.0
std        1.0       1.0      1.0    3399.0
min        0.0       0.0      1.0       0.0
25%        1.0       1.0      2.0     224.0
50%        2.0       2.0      3.0     521.0
75%        2.0       2.0      4.0     670.0
max       26.0      12.0     16.0  433014.0

In [17]:
df['YearBuilt'].value_counts().to_frame().reset_index()

     YearBuilt  count
0       1970.0   1490
1       1960.0   1260
2       1950.0   1089
3       1980.0    726
4       1900.0    606
..         ...    ...
155     1830.0      1
156     2106.0      1
157     1897.0      1
158     1876.0      1
159     1879.0      1

[160 rows x 2 columns]

In [20]:
df['Regionname'].value_counts().to_frame().reset_index()

                   Regionname  count
0       Southern Metropolitan  11836
1       Northern Metropolitan   9557
2        Western Metropolitan   6799
3        Eastern Metropolitan   4377
4  South-Eastern Metropolitan   1739
5            Eastern Victoria    228
6           Northern Victoria    203
7            Western Victoria    115

In [43]:
df['CouncilArea'].value_counts().reset_index()

                       CouncilArea  count
0          Boroondara City Council   3675
1             Darebin City Council   2851
2            Moreland City Council   2122
3           Glen Eira City Council   2006
4           Melbourne City Council   1952
5             Banyule City Council   1861
6       Moonee Valley City Council   1791
7             Bayside City Council   1764
8            Brimbank City Council   1593
9              Monash City Council   1466
10        Stonnington City Council   1460
11        Maribyrnong City Council   1451
12       Port Phillip City Council   1280
13               Hume City Council   1214
14              Yarra City Council   1186
15         Manningham City Council   1046
16        Hobsons Bay City Council    942
17           Kingston City Council    871
18         Whittlesea City Council    828
19            Wyndham City Council    624
20         Whitehorse City Council    618
21          Maroondah City Council    506
22               Knox City Council    371
23  Greater Dandenong City Council    314
24             Melton City Council    292
25          Frankston City Council    290
26              Casey City Council    176
27      Yarra Ranges Shire Council    102
28         Nillumbik Shire Council     88
29    Macedon Ranges Shire Council     46
30          Cardinia Shire Council     41
31          Mitchell Shire Council     20
32         Moorabool Shire Council      7

In [42]:
# Mean of rooms
df[['Rooms', 'Car']].mean()

Rooms    3.031012
Car      1.728845
dtype: float64

In [35]:
df['Rooms'].median()

np.float64(3.0)

In [45]:
df[['Regionname', 'Type']].value_counts().reset_index()

                    Regionname Type  count
0        Southern Metropolitan    h   6968
1        Northern Metropolitan    h   6489
2         Western Metropolitan    h   5199
3        Southern Metropolitan    u   3536
4         Eastern Metropolitan    h   3438
5        Northern Metropolitan    u   2033
6   South-Eastern Metropolitan    h   1356
7        Southern Metropolitan    t   1332
8        Northern Metropolitan    t   1035
9         Western Metropolitan    u    946
10        Western Metropolitan    t    654
11        Eastern Metropolitan    u    548
12        Eastern Metropolitan    t    391
13  South-Eastern Metropolitan    u    221
14            Eastern Victoria    h    216
15           Northern Victoria    h    199
16  South-Eastern Metropolitan    t    162
17            Western Victoria    h    113
18            Eastern Victoria    u      7
19            Eastern Victoria    t      5
20           Northern Victoria    u      3
21            Western Victoria    u      2
22           Northern Victoria    t      1

In [47]:
# Bivariate Analysis
df[['Type', 'Method']].value_counts().reset_index()

   Type Method  count
0     h      S  14047
1     u      S   3816
2     h     SP   3293
3     h     PI   3214
4     h     VB   1942
5     t      S   1881
6     u     SP   1292
7     u     PI   1031
8     h     SN   1015
9     u     VB    786
10    t     PI    605
11    t     SP    510
12    t     VB    380
13    u     SN    191
14    h     PN    182
15    h     SA    155
16    t     SN    111
17    h      W    104
18    u     PN     77
19    u      W     56
20    t     PN     49
21    u     SA     44
22    h     SS     28
23    t     SA     27
24    t      W     13
25    t     SS      4
26    u     SS      4

In [ ]:
# How to handle NA values
# How to create a custom column based on value of other columns